<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"688024945d48debe5ab15edc2b9b7331390071f6ad107123026db959c247921e","plan_job_ref":"Job terraform plan #101 at https://github.com/suzutan/infra/actions/runs/15060322497","plan_out_hash":"f8e1ece67275809eb5aca955baeb723285d9b7e76c6bdad32268ace749142a6a","plan_hash":"05f528fd9e8bddb6fb8a304e46f9bee2f660ad348b47d44e256da981fba0ee37","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 2 to add, 9 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_dns_record.metrics["grafana.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "metrics" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "cfff2a49-c9fc-4675-8bcb-c29716fb441f.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:06Z" -> (known after apply)
        id                  = "b5922ffac1ff13110d4479a82591bc82"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:06Z" -> (known after apply)
        name                = "grafana.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.metrics["prometheus.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "metrics" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "cfff2a49-c9fc-4675-8bcb-c29716fb441f.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:06Z" -> (known after apply)
        id                  = "614550330884bcf9e43d66158b7dbd89"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:06Z" -> (known after apply)
        name                = "prometheus.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.metrics must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared" "metrics" {
!~      account_tag       = "3b433b4bc6b6f9770dbf88886748ec8b" -> (known after apply)
+       config_src        = "local" # forces replacement
!~      connections       = [
-           {
-               client_id            = "5fbd506c-8d86-4168-bb70-0955eb06ff10" -> null
-               client_version       = "2025.4.2" -> null
-               colo_name            = "nrt08" -> null
-               id                   = "4777fe27-e657-4752-9901-c415e6439eb6" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-05-15T18:45:56Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "4777fe27-e657-4752-9901-c415e6439eb6" -> null
            },
-           {
-               client_id            = "5fbd506c-8d86-4168-bb70-0955eb06ff10" -> null
-               client_version       = "2025.4.2" -> null
-               colo_name            = "nrt09" -> null
-               id                   = "83357c8b-f8bb-4aaa-8e14-3be0102d0fd5" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-05-15T18:50:45Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "83357c8b-f8bb-4aaa-8e14-3be0102d0fd5" -> null
            },
-           {
-               client_id            = "5fbd506c-8d86-4168-bb70-0955eb06ff10" -> null
-               client_version       = "2025.4.2" -> null
-               colo_name            = "nrt08" -> null
-               id                   = "fe3474e6-ef7b-4bc2-b9bf-438261cafbf4" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-05-14T12:09:55Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "fe3474e6-ef7b-4bc2-b9bf-438261cafbf4" -> null
            },
-           {
-               client_id            = "5fbd506c-8d86-4168-bb70-0955eb06ff10" -> null
-               client_version       = "2025.4.2" -> null
-               colo_name            = "nrt01" -> null
-               id                   = "cf8e39c1-4a85-431c-864c-109254a6e4f7" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-05-14T12:09:56Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "cf8e39c1-4a85-431c-864c-109254a6e4f7" -> null
            },
        ] -> (known after apply)
!~      conns_active_at   = "2025-05-14T12:09:54Z" -> (known after apply)
+       conns_inactive_at = (known after apply)
!~      created_at        = "2025-03-09T14:39:05Z" -> (known after apply)
+       deleted_at        = (known after apply)
!~      id                = "************************************" -> (known after apply)
!~      metadata          = jsonencode({}) -> (known after apply)
        name              = "metrics-ingress"
!~      remote_config     = true -> (known after apply)
!~      status            = "healthy" -> (known after apply)
!~      tun_type          = "cfd_tunnel" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress        = [
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
+                   origin_request = (known after apply)
#                    (2 unchanged attributes hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-04-10T19:52:30Z" -> (known after apply)
        id         = "36d574cb-f554-4320-a995-61af899df181"
!~      source     = "cloudflare" -> "local"
!~      version    = 1 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.metrics will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared_config" "metrics" {
+       account_id = "********************************"
+       config     = {
+           ingress        = [
+               {
+                   hostname       = "grafana.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "grafana.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "grafana.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "prometheus.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "prometheus.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "prometheus.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   origin_request = (known after apply)
+                   service        = "http_status:404"
#                    (1 unchanged attribute hidden)
                },
            ]
+           origin_request = (known after apply)
+           warp_routing   = (known after apply)
        }
+       created_at = (known after apply)
+       id         = (known after apply)
+       source     = "local"
+       tunnel_id  = (known after apply)
+       version    = (known after apply)
    }

  # module.fastmail.cloudflare_dns_record.dkim_1 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_1" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
        id                  = "f938c55afcc58eddc6c29cdf43ab5b0d"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-07T23:26:57Z" -> (known after apply)
!~      name                = "fm1._domainkey.harvestasya.org" -> "fm1._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_2 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_2" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
        id                  = "63d7a93d4c4f663e4778444f2429008f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-07T23:26:57Z" -> (known after apply)
!~      name                = "fm2._domainkey.harvestasya.org" -> "fm2._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_3 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_3" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
        id                  = "99aa31b80dc1647ae04b0577b6b8817a"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-07T23:26:57Z" -> (known after apply)
!~      name                = "fm3._domainkey.harvestasya.org" -> "fm3._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.mx_0 will be updated in-place
!~  resource "cloudflare_dns_record" "mx_0" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
        id                  = "88df54f011e43b8cd63fe2af3d87ac90"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "harvestasya.org" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.mx_1 will be updated in-place
!~  resource "cloudflare_dns_record" "mx_1" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
        id                  = "f1e2153c963f2c51a0b70a23de360a05"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "harvestasya.org" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.spf will be updated in-place
!~  resource "cloudflare_dns_record" "spf" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
        id                  = "3ea3655515aa129005268d46d520f4df"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "harvestasya.org" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 2 to add, 9 to change, 1 to destroy.

Warning: Resource Destruction Considerations

  with cloudflare_zero_trust_tunnel_cloudflared_config.metrics,
  on tunnel_metrics.tf line 15, in resource "cloudflare_zero_trust_tunnel_cloudflared_config" "metrics":
  15: resource "cloudflare_zero_trust_tunnel_cloudflared_config" "metrics" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.
```
</details>

:memo: Plan generated in [terraform plan #101](https://github.com/suzutan/infra/actions/runs/15060322497)